Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོད་པས། དགེ་བའི་ཆོས་ཐམས་ཅད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ།
en: If you ask why, Śāradvatīputra, it is because it is the very presence of bodhisattva great beings that causes all virtuous attributes to emerge in the world.

source: འདི་ལྟར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་དང་། བསླབ་པའི་གནས་ལྔ་དང་། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། རྗེས་སུ་དྲན་པ་དྲུག་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་།
en: So it is that the paths of the ten virtuous actions, the five precepts, the eightfold poṣadha for monastics, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the six recollections, the perfections, all the aspects of emptiness, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path emerge in the world.

source: འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: So it is that the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, all the meditative stabilities, and all the dhāraṇī gateways emerge in the world.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: So it is that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas emerge in the world. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་དགེ་བའི་ཆོས་དེ་དག་ལ་སོགས་པ་མང་པོ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་ཏེ། དགེ་བའི་ཆོས་དེ་དག་འཇིག་རྟེན་དུ་བྱུང་བས། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་དག་ཡོད་པ་ཡིན། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་དག་ཡོད་པ་ཡིན། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་དག་ཡོད་པ་ཡིན། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཡོད་པ་ཡིན། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཡོད་པ་ཡིན། ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ཡོད་པ་ཡིན། ཚངས་ལྷ་ཉེ་ཕན་གྱི་ལྷ་རྣམས་དང་། ཚངས་པ་ཀུན་འཁོར་གྱི་ལྷ་རྣམས་དང་། ཚངས་ཆེན་གྱི་ལྷ་རྣམས་དང་། སྣང་བའི་ལྷ་རྣམས་དང་། ཆུང་སྣང་གི་ལྷ་རྣམས་དང་།
en: Śāradvatīputra, there are many phenomena—starting from those virtuous attributes—that emerge in the world.

source: ཚད་མེད་སྣང་བའི་ལྷ་རྣམས་དང་། ཀུན་སྣང་དང་བའི་ལྷ་རྣམས་དང་། དགེ་བའི་ལྷ་རྣམས་དང་། ཆུང་དགེའི་ལྷ་རྣམས་དང་། ཚད་མེད་དགེ་བའི་ལྷ་རྣམས་དང་། དགེ་རྒྱས་ཀྱི་ལྷ་རྣམས་དང་། ཆེ་བའི་ལྷ་རྣམས་དང་། ཆུང་ཆེའི་ལྷ་རྣམས་དང་། ཚད་མེད་ཆེ་བའི་ལྷ་རྣམས་དང་། འབྲས་བུ་ཆེ་བའི་ལྷ་རྣམས་དང་། མི་ཆེ་བའི་ལྷ་རྣམས་དང་། མི་གདུང་བའི་ལྷ་རྣམས་དང་། ཤིན་ཏུ་མཐོང་བའི་ལྷ་རྣམས་དང་། གྱ་ནོམ་སྣང་བའི་ལྷ་རྣམས་དང་།
en: It is because those virtuous attributes have emerged in the world that there are great and lofty royal families to be found, that there are great and lofty priestly families to be found, that there are great and lofty householder families to be found, that there are the gods of the Caturmahā­rāja­kāyika to be found, that there are the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin to be found, that there are the gods of the Brahmakāyika realms to be found, and that there are the gods of Brahmapurohita, the gods of Brahma­pariṣadya, the gods of Mahābrahmā, the gods of Ābha, the gods of Parīttābha, the gods of Apramāṇābha, the gods of Ābhāsvara, the gods of Śubha, the gods of Parīttaśubha, the gods of Apramāṇaśubha, the gods of Śubhakṛtsna, the gods of Bṛhat, the gods of Parīttabṛhat, the gods of Apramāṇabṛhat, the gods of Bṛhatphala, the gods of Avṛha, the gods of Atapa, the gods of Sudṛśa, the gods of Sudarśana, and the gods of Akaniṣṭha to be found.

source: འོག་མིན་གྱི་ལྷ་རྣམས་ཡོད་པ་ཡིན། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཡོད་པ་ཡིན། རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་།
en: So it is, too, that there are the gods of the sphere of infinite space, the gods of the sphere of infinite consciousness, {Dt.43} the gods of the sphere of nothing-at-all, and the gods of the sphere of neither perception nor nonperception to be found.

source: ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་ན་ཡོད་པ་ཡིན་ནོ།
en: So it is, too, that there are those entering the stream to nirvāṇa, those destined for only one more rebirth, those no longer subject to rebirth, those who are arhats, those who are pratyekabuddhas, those who are bodhisattva great beings, and those who are tathāgatas, arhats, completely awakened buddhas to be found in the world.”

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ལྟ་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སྦྱིན་པ་ཡོངས་སུ་སྦྱོང་བ་ལགས་སམ།
en: Then Śāradvatīputra asked, “Blessed Lord, in that case do bodhisattva great beings purify those offerings?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་སྦྱིན་པ་རྣམ་གྲངས་ཀྱིས་ཡོངས་སུ་སྦྱོང་སྟེ།
en: Śāradvatīputra,” replied the Blessed One, “bodhisattva great beings purify those offerings in a manner.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ནི་སྦྱིན་པ་ཀུན་ཀྱང་ཤིན་ཏུ་དག་པ་སྟེ། དེ་ཡང་འདི་ལྟར་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ། ཅིའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཞེ་ན།
en: If you ask how, it is because, for bodhisattva great beings, all giving whatsoever is utterly pure, and indeed it is in that very manner, Śāradvatīputra, that bodhisattva great beings give away what they give.

source: དགེ་བའི་ཆོས་དུ་མའི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ།
en: If you ask what it is that they give away, they give away many virtuous attributes.

source: འདི་ལྟར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་དང་། བསླབ་པའི་གནས་ལྔ་དང་། ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། རྗེས་སུ་དྲན་པ་དྲུག་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ངོ་།
en: Thus they give away the paths of the ten virtuous actions, the five precepts, the eightfold poṣadha for monastics, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the six recollections, the perfections, all the aspects of emptiness, the four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas.”

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱིས་ན་བརྩོན་ཞེས་བགྱི་བ་ལགས།
en: Śāradvatīputra then asked, “Blessed Lord, how do bodhisattva great beings ‘engage’ with it when they engage with the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: Śāradvatīputra,” replied the Blessed One, “bodhisattva great beings are said to ‘engage’ with it when they engage with the emptiness of physical forms. {

source: །ཚོར་བ་སྟོང་པ་ཉིད་དང་། འདུ་ཤེས་སྟོང་པ་ཉིད་དང་། འདུ་བྱེད་སྟོང་པ་ཉིད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: Dt.44} They are said to ‘engage’ with it when they engage with the emptiness of feelings, the emptiness of perceptions, the emptiness of formative predispositions, and the emptiness of consciousness.

source: །མིག་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: They are said to ‘engage’ with it when they engage with the emptiness of the eyes.

source: །རྣ་བ་སྟོང་པ་ཉིད་དང་། སྣ་སྟོང་པ་ཉིད་དང་། ལྕེ་སྟོང་པ་ཉིད་དང་། ལུས་སྟོང་པ་ཉིད་དང་། ཡིད་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: They are said to ‘engage’ with it when they engage with the emptiness of the ears, the emptiness of the nose, the emptiness of the tongue, the emptiness of the body, and the emptiness of the mental faculty.

source: །གཟུགས་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: They are said to ‘engage’ with it when they engage with the emptiness of sights.

source: །སྒྲ་སྟོང་པ་ཉིད་དང་། དྲི་སྟོང་པ་ཉིད་དང་། རོ་སྟོང་པ་ཉིད་དང་། རེག་སྟོང་པ་ཉིད་དང་། ཆོས་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: They are said to ‘engage’ with it when they engage with the emptiness of sounds, the emptiness of odors, the emptiness of tastes, the emptiness of tangibles, and the emptiness of mental phenomena.

source: །མིག་གི་ཁམས་སྟོང་པ་ཉིད་དང་། གཟུགས་ཀྱི་ཁམས་སྟོང་པ་ཉིད་དང་། མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ། །རྣ་བའི་ཁམས་སྟོང་པ་ཉིད་དང་། སྒྲའི་ཁམས་སྟོང་པ་ཉིད་དང་།
en: They are said to ‘engage’ with it when they engage with the emptiness of the sensory element of the eyes, the emptiness of the sensory element of sights, and the emptiness of the sensory element of visual consciousness.

source: རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་སྟོང་པ་ཉིད་དང་། སྣའི་ཁམས་སྟོང་པ་ཉིད་དང་། དྲིའི་ཁམས་སྟོང་པ་ཉིད་དང་། སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་སྟོང་པ་ཉིད་དང་། ལྕེའི་ཁམས་སྟོང་པ་ཉིད་དང་། རོའི་ཁམས་སྟོང་པ་ཉིད་དང་། ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་སྟོང་པ་ཉིད་དང་། ལུས་ཀྱི་ཁམས་སྟོང་པ་ཉིད་དང་། རེག་བྱའི་ཁམས་སྟོང་པ་ཉིད་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་སྟོང་པ་ཉིད་དང་། ཡིད་ཀྱི་ཁམས་སྟོང་པ་ཉིད་དང་། ཆོས་ཀྱི་ཁམས་སྟོང་པ་ཉིད་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: They are said to ‘engage’ with it when they engage with the emptiness of the sensory element of the ears, the emptiness of the sensory element of sounds, and the emptiness of the sensory element of auditory consciousness; or with the emptiness of the sensory element of the nose, the emptiness of the sensory element of odors, and the emptiness of the sensory element of olfactory consciousness; or with the emptiness of the sensory element of the tongue, the emptiness of the sensory element of tastes, and the emptiness of the sensory element of gustatory consciousness; or with the emptiness of the sensory element of the body, the emptiness of the sensory element of touch, and the emptiness of the sensory element of tactile consciousness; or with the emptiness of the sensory element of the mental faculty, the emptiness of the sensory element of phenomena, and the emptiness of the sensory element of mental consciousness. “

source: །སྡུག་བསྔལ་སྟོང་པ་ཉིད་དང་། ཀུན་འབྱུང་བ་སྟོང་པ་ཉིད་དང་། འགོག་པ་སྟོང་པ་ཉིད་དང་། ལམ་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ། །མ་རིག་པ་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ། །འདུ་བྱེད་སྟོང་པ་ཉིད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པ་ཉིད་དང་།
en: They are said to ‘engage’ with it when they engage with emptiness of suffering, with the emptiness of the origin of suffering, with the emptiness of the cessation of suffering, and with the emptiness of the path. “

source: མིང་དང་གཟུགས་སྟོང་པ་ཉིད་དང་། སྐྱེ་མཆེད་དྲུག་སྟོང་པ་ཉིད་དང་། རེག་པ་སྟོང་པ་ཉིད་དང་། ཚོར་བ་སྟོང་པ་ཉིད་དང་། སྲེད་པ་སྟོང་པ་ཉིད་དང་། ལེན་པ་སྟོང་པ་ཉིད་དང་། སྲིད་པ་སྟོང་པ་ཉིད་དང་། སྐྱེ་བ་སྟོང་པ་ཉིད་དང་། རྒ་ཤི་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: They are said to ‘engage’ with it when they engage with the emptiness of ignorance, with the emptiness of formative predispositions, with the emptiness of consciousness, with the emptiness of name and form, with the emptiness of the sense fields, with the emptiness of sensory contact, with the emptiness of sensation, with the emptiness of craving, with the emptiness of grasping, with the emptiness of the rebirth process, with the emptiness of actual birth, and with the emptiness of aging and death. “

source: །ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ། །འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་གང་ཇི་སྙེད་མིང་གདགས་སུ་ཡོད་པ་དེ་དག་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: They are said to ‘engage’ with it when they engage with the emptiness of all phenomena, as many as are designated as conditioned and unconditioned. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རང་བཞིན་སྟོང་པ་ཉིད་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱ་སྟེ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they are said to ‘engage’ with it when they engage with the emptiness of inherent existence.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྟོང་པ་ཉིད་བདུན་པོ་འདི་དག་ལ་བརྩོན་ན་བརྩོན་ཞེས་བྱའོ།
en: So accordingly, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they are said to ‘engage’ with it when they engage with those seven emptinesses. “

source: །དེ་སྟོང་པ་ཉིད་བདུན་པོ་འདི་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱེད་ཀྱང་བརྩོན་ཞེའམ་མི་བརྩོན་ཞེས་མི་བརྗོད་དེ།
en: Those who engage with the perfection of wisdom through those seven emptinesses are not said to be engaged with it or not to be engaged with it.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་གཟུགས་བརྩོན་ཞེས་བྱ་བའམ་མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because they do not consider physical forms to be engaged with it or not engaged with it.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་བརྩོན་ཞེ་འམ་མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not consider feelings, perceptions, formative predispositions, or consciousness to be engaged with it or not engaged with it. “

source: །གཟུགས་སྐྱེ་བའི་ཆོས་ཅན་ནམ་འགག་པའི་ཆོས་ཅན་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not consider physical forms to be something that arises or something that ceases. {

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་སྐྱེ་བའི་ཆོས་ཅན་ནམ་འགག་པའི་ཆོས་ཅན་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Dt.45} They do not consider feelings, perceptions, formative predispositions, and consciousness to be something that arises or something that ceases.

source: །གཟུགས་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཅན་ནམ། རྣམ་པར་བྱང་བའི་ཆོས་ཅན་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not consider physical forms to be something that is defiled or something that is purified.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཅན་ནམ་རྣམ་པར་བྱང་བའི་ཆོས་ཅན་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not consider feelings, perceptions, formative predispositions, and consciousness to be something that is defiled or something that is purified. “

source: །གཟུགས་ནི་ཚོར་བ་དང་ལྷན་ཅིག་ཀུན་དུ་རྒྱུ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not consider physical forms to move together with feelings.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་ནི། རྣམ་པར་ཤེས་པ་དང་ལྷན་ཅིག་ཀུན་དུ་རྒྱུ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not consider feelings, perceptions, and formative predispositions to move together with consciousness.

source: །རྣམ་པར་ཤེས་པ་ནི་འདུ་བྱེད་དང་ལྷན་ཅིག་ཀུན་དུ་རྒྱུ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not consider consciousness to move together with formative predispositions.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་གང་ཡང་ཆོས་གང་དང་ཡང་ལྷན་ཅིག་ཀུན་དུ་རྒྱུ་བ་མེད་དེ།
en: If you ask why, it is because there is no phenomenon that moves together with any [other] phenomenon.

source: རང་བཞིན་གྱིས་སྟོང་པའི་ཕྱིར་འགྲོ་བ་མེད་དོ། །རྣམ་པར་འགྲོ་བ་མེད་དོ། །འདུ་བ་མེད་དོ།
en: Owing to the emptiness of inherent existence, there is no moving, there is no departure, there is no meeting, and there is no association. “

source: །རྣམ་པར་འདུ་བ་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན།
en: Śāradvatīputra, the emptiness of physical forms is not physical forms.

source: ཚོར་བའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཚོར་བ་མ་ཡིན།
en: The emptiness of feelings is not feelings.

source: འདུ་ཤེས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་འདུ་ཤེས་མ་ཡིན།
en: The emptiness of perceptions is not perceptions.

source: འདུ་བྱེད་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་འདུ་བྱེད་མ་ཡིན།
en: The emptiness of formative predispositions is not formative predispositions.

source: རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་ཤེས་པ་མ་ཡིན་ཏེ།
en: The emptiness of consciousness is not consciousness.

source: འདི་ལྟར་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཐོགས་པར་བྱེད་པ་མེད་དོ། །ཚོར་བའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ཚོར་བར་མི་བྱེད་དོ། །འདུ་ཤེས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་འདུ་ཤེས་སུ་མི་བྱེད་དོ། །འདུ་བྱེད་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་མངོན་པར་འདུ་མི་བྱེད་དོ། །རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་རྣམ་པར་ཤེས་པར་མི་བྱེད་དོ།
en: Accordingly, the emptiness of physical forms does not obstruct, the emptiness of feelings does not feel, the emptiness of perceptions does not perceive, the emptiness of formative predispositions does not condition, {Dt.46} and the emptiness of consciousness does not cognize. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ཀྱང་གཞན་མ་ཡིན་ལ། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ལ། གཟུགས་ཀྱང་གཞན་མ་ཡིན་ཏེ།
en: If you ask why, Śāradvatīputra, physical forms are not other than emptiness, and emptiness is not other than physical forms.

source: གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ལ།
en: The nature of physical forms is emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ།
en: Emptiness is physical forms.

source: །ཚོར་བ་ཡང་གཞན་མ་ཡིན་ལ་སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ལ་ཚོར་བ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Feelings are not other than emptiness, and emptiness is not other than feelings.

source: ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ལ།
en: The nature of feelings is emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་ཚོར་བའོ།
en: Emptiness is feelings.

source: །འདུ་ཤེས་ཀྱང་གཞན་མ་ཡིན་ལ། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ལ། འདུ་ཤེས་ཀྱང་གཞན་མ་ཡིན་ཏེ།
en: Perceptions are not other than emptiness, and emptiness is not other than perceptions.

source: འདུ་ཤེས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ལ།
en: The nature of perceptions is emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་འདུ་ཤེས་སོ། །འདུ་བྱེད་རྣམས་ཀྱང་གཞན་མ་ཡིན་ལ།
en: Emptiness is perceptions.

source: སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ལ། འདུ་བྱེད་རྣམས་ཀྱང་གཞན་མ་ཡིན་ཏེ།
en: Formative predispositions are not other than emptiness, and emptiness is not other than formative predispositions.

source: འདུ་བྱེད་རྣམས་ཀྱང་སྟོང་པ་ཉིད་ལ།
en: The nature of formative predispositions is emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་འདུ་བྱེད་རྣམས་སོ།
en: Emptiness is formative predispositions.

source: །རྣམ་པར་ཤེས་པ་ཡང་གཞན་མ་ཡིན་ལ། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ལ། རྣམ་པར་ཤེས་པ་ཡང་གཞན་མ་ཡིན་ཏེ།
en: Consciousness is not other than emptiness, and emptiness is not other than consciousness.

source: རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ལ།
en: The nature of consciousness is emptiness.

source: སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: Emptiness is consciousness. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་མི་སྐྱེ་མི་འགག་ཅིང་།
en: Śāradvatīputra, emptiness neither arises nor ceases.

source: ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་མེད། རྣམ་པར་བྱང་བ་མེད་ལ།
en: It is neither afflicted nor purified.

source: འགྲིབ་པ་མེད་ཅིང་འཕེལ་བ་མེད་པ་སྟེ།
en: It neither decreases nor increases.

source: དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །གང་མི་སྐྱེ་མི་འགག་ཅིང་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་མེད། རྣམ་པར་བྱང་བ་མེད་པ་ལ།
en: It is neither past, nor future, nor present.

source: མི་འགྲིབ་མི་འཕེལ་ཏེ། འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་པ་དེ་ལ་ནི་གཟུགས་མེད་དོ། །ཚོར་བ་མེད་དོ། །འདུ་ཤེས་མེད་དོ། །འདུ་བྱེད་མེད་དོ། །རྣམ་པར་ཤེས་པ་མེད་དོ།
en: In that which neither arises nor ceases, is neither afflicted nor purified, neither decreases nor increases, and is neither past, nor future, nor present, there are no physical forms, no feelings, no perceptions, no formative predispositions, and no consciousness.

source: །དེ་ལ་ནི་མིག་མེད་དོ། །རྣ་བ་མེད་དོ། །སྣ་མེད་དོ། །ལྕེ་མེད་དོ། །ལུས་མེད་དོ། །ཡིད་མེད་དོ། །དེ་ལ་ནི་གཟུགས་མེད་དོ། །སྒྲ་མེད་དོ། །དྲི་མེད་དོ། །རོ་མེད་དོ། །རེག་བྱ་མེད་དོ། །ཆོས་མེད་དོ། །དེ་ལ་ནི་སའི་ཁམས་མེད་དོ།
en: In that, there are no eyes, no ears, no nose, no tongue, no body, no mental faculty, no sights, no sounds, no odors, no tastes, no tangibles, and no mental phenomena. “

source: །ཆུའི་ཁམས་མེད་དོ། །མེའི་ཁམས་མེད་དོ། །རླུང་གི་ཁམས་མེད་དོ། །ནམ་མཁའི་ཁམས་མེད་དོ། །རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །དེ་ལ་ནི་མིག་གི་ཁམས་མེད་དོ། །གཟུགས་ཀྱི་ཁམས་མེད་དོ།
en: In that, there is no earth element, no water element, no fire element, no wind element, no consciousness element, and no space element.

source: །མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །རྣ་བའི་ཁམས་མེད་དོ། །སྒྲའི་ཁམས་མེད་དོ། །རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །སྣའི་ཁམས་མེད་དོ། །དྲིའི་ཁམས་མེད་དོ། །སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །ལྕེའི་ཁམས་མེད་དོ། །རོའི་ཁམས་མེད་དོ། །ལྕེའི་
en: In that, there is no sensory element of the eyes, no sensory element of sights, no sensory element of visual consciousness, no sensory element of the ears, no sensory element of sounds, no sensory element of auditory consciousness, no sensory element of the nose, no sensory element of odors, no sensory element of olfactory consciousness, no sensory element of the tongue, no sensory element of tastes, no sensory element of gustatory consciousness, no sensory element of the body, no sensory element of touch, no sensory element of tactile consciousness, no sensory element of the mental faculty, no sensory element of mental phenomena, and no sensory element of mental consciousness. “

source: རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །ལུས་ཀྱི་ཁམས་མེད་དོ། །རེག་བྱའི་ཁམས་མེད་དོ། །ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །ཡིད་ཀྱི་ཁམས་མེད་དོ། །ཆོས་ཀྱི་ཁམས་མེད་དོ། །ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་མེད་དོ། །དེ་ལ་ནི་མ་རིག་པ་མེད་དོ། །མ་རིག་པ་འགག་པ་མེད་དོ། །འདུ་བྱེད་མེད་དོ། །འདུ་བྱེད་འགག་པ་མེད་དོ། །རྣམ་པར་ཤེས་པ་མེད་དོ། །རྣམ་པར་ཤེས་པ་འགག་པ་མེད་དོ། །མིང་དང་གཟུགས་མེད་དོ། །མིང་དང་གཟུགས་འགག་པ་མེད་དོ། །སྐྱེ་མཆེད་དྲུག་མེད་དོ། །སྐྱེ་མཆེད་དྲུག་འགག་པ་མེད་དོ། །རེག་པ་མེད་དོ། །རེག་པ་འགག་པ་མེད་དོ། །ཚོར་བ་མེད་དོ། །ཚོར་བ་འགག་པ་མེད་དོ། །སྲེད་པ་མེད་དོ། །སྲེད་པ་འགག་པ་མེད་དོ། །ལེན་པ་མེད་དོ། །ལེན་པ་འགག་པ་མེད་དོ། །སྲིད་པ་མེད་དོ། །སྲིད་པ་འགག་པ་མེད་དོ། །སྐྱེ་བ་མེད་དོ། །སྐྱེ་བ་འགག་པ་མེད་དོ། །རྒ་ཤི་མེད་དོ། །རྒ་ཤི་འགག་པ་མེད་དོ།
en: In that, there is no ignorance, no cessation of ignorance, no formative predispositions, no cessation of formative predispositions, no consciousness, no cessation of consciousness, no name and form, no cessation of name and form, no six sense fields, no cessation of the six sense fields, no sensory contact, no cessation of sensory contact, no sensation, no cessation of sensation, no craving, no cessation of craving, no grasping, no cessation of grasping, no rebirth process, no cessation of the rebirth process, no actual birth, no cessation of actual birth, {Dt.47} no aging and death, and no cessation of aging and death. “
